print(15%4) #залишок від ділення
print(3**4) # степінь
print(15//4) #цілочисельне ділення 
print("я красотка "*5) # конкатинація - об'єднання двох рядків, +
print("lala" + " lulu") # мультиплікація - повторювання тексту, *
name = input("ВВедіть ваше ім'я") #input кладе в змінну те, що введе користувач
age=int(input("Скільки років")) # Функція input завжди повертає рядок, тому, щоб було число, перед цим треба int написати

# форматування - вставити в текст змінну, a="ddd" b="fgcd", age=34
# 1: "f-string". f"{a} {b}, вік: {age}" , де ,вік: - вставлений текст   
# 2: "{} {}, вік: {}".format(a,b)    метод .format
#Result: ddd fgcd, вік: 34
a='ніколи'
b="кажи"
print(f"{a} не {b} {a}")